neosoultech/bioimpedance_msp430_test/main.c
	// init
	i2c_pins_init();
	i2c_init();
	i2c_bus_recover(); // force I2C bus/pins back to clean idle state after previous stuck transaction
	spi_pins_init();
	spi_init();
	#if USE_BIOZ_MUX
	    bioz_mux_init();
	#endif
    #if USE_MSP_FCLK
	fclk_init();
    #endif
	#if USE_EXP430_S1
	    button_s1_init();
	#endif
	gpo_init();
	max_int_init();
	__enable_interrupt(); // enabling global interrupts


	// TEST FUNCTIONS
	while(1) {
#if TEST_MODE // if test mode enabled


    #if TEST_ST25_WRITE // TEST 1: MCU WRITE --> ST25
	    if (st25dv_write(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR, 0xAA)) { // sending test byte 0xAA to address 0x01F0 on ST25DV (slave addr 0x53). Checking to see if successful (ST25DV will respond)
	                led_pulse_transmission(); // pulse LED if transmission success
	                }
	            else {
	                error_handler(); // if not successful (ERR), LED is solid forever
	            }

    #elif TEST_ST25_READ // TEST 2: MCU READ <-- ST25
	    uint8_t val; // declare value variable
	    st25dv_write(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR, 0xAA); // write 0xAA to 0x01F0 on st25dv
	    __delay_cycles(1000000); // 1s to wait for it to store in mem
	    val = st25dv_read(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR); // reading it back from 0x01F0
	    if (val == 0xAA){
	        led_pulse_transmission(); // pulse LED for success
	    }
	    else {
	        error_handler(); // solid for failure
	    }
	    __delay_cycles(1000000);

    #elif TEST_ST25_GPO // TEST 3: SEE IF ST25 SENDS PHONE DETECT SIGNAL ON GPO
	    if (phone_flag == 1) { // if detect phone
	        phone_flag = 0; // clear interrupt event after handling
	        led_pulse_transmission(); // pulse LED
	    }
	    else {
	        led_idle(); // LED stays off
	    }

#elif RUN_PHONE_NFC_DEMO // Phone tap demo: app scan --> measure/write result --> app read result
        if (phone_flag) {
            phone_flag = 0;

            uint8_t msg[260];
            uint16_t msg_len;

            if (demo_result_pending == 0) {
                // First tap: App initiates NFC read; NFC field triggers measurement
                // MCU measures target/baseline and writes result text to tag.

                int32_t target_avg;
                int32_t reference_avg;

                // TARGET MEASUREMENT
                debug_st25_fail_step = 60; // entered first tap / measure-result path

                __delay_cycles(2000000); // 2 sec delay after NFC trigger


                debug_st25_fail_step = 65; // about to configure MAX

                debug_max_collect_failed = 0;
                debug_max_wait_timeout_count = 0;
                max_flag = 0;

                max30002_configure_bioz_once();

                debug_st25_fail_step = 66; // MAX configured, preparing selected path
                BIOZ_SELECT_TARGET();
                bioz_prepare_selected_path();

                debug_st25_fail_step = 67; // collecting live MAX BioZ average

                target_avg = max30002_collect_bioz_average(16);

                if (debug_max_collect_failed) {
                    debug_st25_fail_step = 68; // MAX BioZ collection timed out
                    error_handler();
                }
                // BASELINE MEASUREMENT
                debug_max_collect_failed = 0;
                debug_max_wait_timeout_count = 0;
                max_flag = 0;
                debug_st25_fail_step = 69; // selecting baseline path
                BIOZ_SELECT_BASELINE();

                bioz_prepare_selected_path();

                debug_st25_fail_step = 70; // collecting baseline BioZ average

                reference_avg = max30002_collect_bioz_average(16);

                if (debug_max_collect_failed) {
                    debug_st25_fail_step = 71; // baseline MAX BioZ collection timed out
                    error_handler();
                }


                debug_target_bioz = target_avg;
                debug_baseline_bioz = reference_avg;
                debug_bioz_diff = target_avg - reference_avg;

                debug_st25_fail_step = 67; // BioZ collected, about to build result

    msg_len = build_bioz_readnfc_text_ndef(msg, sizeof(msg), target_avg, reference_avg);

                if (msg_len == 0) {
                    debug_st25_fail_step = 61; // result builder failed
                    error_handler();
                }

                debug_st25_fail_step = 62; // result built, about to write EEPROM

                if (st25dv_write_ndef_text_eeprom(msg, msg_len)) {
                    __delay_cycles(100000);

                    demo_result_pending = 1; // next tap goes to read
                    phone_flag = 0; // clear stale phone event that may have occurred during processing
                    P2IFG &= ~BIT0; // clear stale GPO interrupt flag

                    debug_st25_fail_step = 0;
                    led_pulse_transmission(); // one pulse = result saved
                }
                else {
                    debug_st25_fail_step = 63; // result EEPROM write failed
                    error_handler();
                }
            }
            else {
                // Second tap: app reads result text from tag, firmware keeps result on tag and only resets internal state.

                debug_st25_fail_step = 70;

                __delay_cycles(5000000); // allow app time to read result text

                debug_st25_fail_step = 72; // result-read window complete

                    demo_result_pending = 0; // next tap measures again
                    phone_flag = 0; // clear stale phone event
                    P2IFG &= ~BIT0; // clear stale GPO interrupt flag
                    debug_st25_fail_step = 0;
                }
        }

    #elif TEST_MAX_SPI // TEST 5: Basic MAX30002 SPI connection test. Checks to see if reads anything from INFO
	    uint32_t info;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // INFO should not be first command after power-up/reset
	    __delay_cycles(10000);

	    info = max30002_read_info();
	    if ((info != 0x000000) && (info != 0xFFFFFF)) { // check to see if anything there
	        led_pulse_transmission(); // Pulse LED; SPI returned something plausible
	    }
	    else {
	        error_handler(); // likely SPI wiring or mode issue. SOLID LED
	    }
	    __delay_cycles(1000000);

	 #elif TEST_MAX_ID // TEST 6: More in depth MAX30002 SPI communication test. Reads/compares info register.
	    uint32_t info;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // read status first as dummy transaction. Cannot read info command right away per data sheet.
	    __delay_cycles(10000); // 10ms delay

	    info = max30002_read_info(); // read info register just as a test for SPI communication
	    debug_info = info;
	    if ((info & 0xF03000) == 0x501000) { // MAX30001 INFO fixed bits: D[23:20] = 0101 and D[13:12] = 01. Mask 0xF03000 should equal 0x501000. INFO is not valid as the first command after SW_RST.

	        led_pulse_transmission(); // pulse LED if what read looks valid
	    }
	    else {
	        error_handler(); // solid LED
	    }
	    __delay_cycles(1000000); // 1 second between test

    #elif TEST_MAX_CONFIG // TEST 7: Write to and read from MAX30002 config registers
	    uint32_t en_int_read;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // read status first as dummy transaction
	    __delay_cycles(10000); // 10ms delay

	    max30002_write_reg(MAX_REG_EN_INT, 0x000002); // writing to low bits of EN_INT register. Open drain NMOS without internal pull up
	    __delay_cycles(10000); // 10 ms delay
	    en_int_read = max30002_read_reg(MAX_REG_EN_INT); // read what we just wrote
	    debug_en_int_read = en_int_read;
	    if ((en_int_read & 0x000003) == MAX_INTB_OPEN_DRAIN) { // lower bits should be '10 (2 decimal)' for open drain
	        debug_config_pass = 1;
	        led_pulse_transmission(); // config write/read worked
	    }
	    else {
	        debug_config_pass = 2;
	        error_handler(); // solid LED if error
	    }
	    __delay_cycles(1000000); // 1 second between tests

    #elif TEST_MAX_START // TEST 8: Configure and start MAX30002 BioZ operation
	    uint32_t bmux;
	    uint32_t en_int_read;
	    uint32_t gen_read;
	    uint32_t mngr_int_read;
	    uint32_t bmux_read;
	    uint32_t bioz_read;

	    max30002_reset(); // reset to known state
	    (void)max30002_read_status(); // dummy transaction. Can't do INFO as first command after reset.
	    __delay_cycles(10000); // 10 ms delay
	    BIOZ_SELECT_TARGET();
	    __delay_cycles(50000); // let mux/electrode path settle

	    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // Configure INTB: allow BioZ FIFO interrupt & overflow to drive INTB, use open drain INTB output
	    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START); // Configure interrupt manager so interrupt if >=1 BioZ sample in FIFO, and interrupt flag clears auto.
	    max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START); // Configure BioZ channel: 32sps, 8.192Khz, low noise, 10V/V gain, midrange current magnitude

	    bmux = max30002_read_reg(MAX_REG_CNFG_BMUX); // read BMUX config
	    bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT); // clear OPENP AND OPENN so BIP and BIN connected to BioZ channel
	    max30002_write_reg(MAX_REG_CNFG_BMUX, bmux); // Connected BIP & BIN to BioZ channel

	    max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START); // Enable BioZ & internal lead biasing. Requires EN_BIOZ to be asserted same time (done)
	    __delay_cycles(100000); // 0.1s startup

