neosoultech/bioimpedance_msp430_test/main.c
        return data;
    }

int st25dv_enable_energy_harvesting_dynamic(void)
{
    uint8_t eh_ctrl;

    debug_st25_fail_step = 90; // starting EH dynamic enable

    eh_ctrl = st25dv_read(ST25DV_ADDR_USER, ST25DV_REG_EH_CTRL_DYN);
    debug_st25_eh_ctrl_before = eh_ctrl;

    if (eh_ctrl == 0xFF) {
        debug_st25_fail_step = 91; // EH_CTRL_DYN read failed
        return 0;
    }

    eh_ctrl |= ST25DV_EH_CTRL_DYN_EH_EN;

    if (!st25dv_write(ST25DV_ADDR_USER, ST25DV_REG_EH_CTRL_DYN, eh_ctrl)) {
        debug_st25_fail_step = 92; // EH_CTRL_DYN write failed
        return 0;
    }

    __delay_cycles(10000);

    eh_ctrl = st25dv_read(ST25DV_ADDR_USER, ST25DV_REG_EH_CTRL_DYN);
    debug_st25_eh_ctrl_after = eh_ctrl;

    if (eh_ctrl == 0xFF) {
        debug_st25_fail_step = 93; // EH_CTRL_DYN readback failed
        return 0;
    }

    if ((eh_ctrl & ST25DV_EH_CTRL_DYN_EH_EN) == 0) {
        debug_st25_fail_step = 94; // EH_EN bit did not stay set
        return 0;
    }

    debug_st25_fail_step = 0;
    return 1;
}
int st25dv_enable_energy_harvesting_static(void)
{
    uint8_t eh_mode;

    debug_st25_fail_step = 95; // starting static EH enable

    if (!st25dv_present_i2c_password()) {
        debug_st25_fail_step = 96; // failed to present I2C password
        return 0;
    }

    if (!st25dv_i2c_session_is_open()) {
        debug_st25_fail_step = 97; // I2C security session did not open
        return 0;
    }

    eh_mode = st25dv_read(ST25DV_ADDR_SYSTEM, ST25DV_REG_EH_MODE);
    debug_st25_eh_mode_before = eh_mode;

    if (eh_mode == 0xFF) {
        debug_st25_fail_step = 98; // EH_MODE read failed
        return 0;
    }

    /*
     * Static EH_MODE bit0 is reversed:
     * bit0 = 0 means automatic energy harvesting enabled.
     * bit0 = 1 means automatic energy harvesting disabled.
     */
    eh_mode &= ~ST25DV_EH_MODE_DISABLE_AUTO;

    if (!st25dv_write(ST25DV_ADDR_SYSTEM, ST25DV_REG_EH_MODE, eh_mode)) {
        debug_st25_fail_step = 99; // EH_MODE write failed
        return 0;
    }

    __delay_cycles(20000); // allow system EEPROM/config write time

    eh_mode = st25dv_read(ST25DV_ADDR_SYSTEM, ST25DV_REG_EH_MODE);
    debug_st25_eh_mode_after = eh_mode;

    if (eh_mode == 0xFF) {
        debug_st25_fail_step = 100; // EH_MODE readback failed
        return 0;
    }

    if (eh_mode & ST25DV_EH_MODE_DISABLE_AUTO) {
        debug_st25_fail_step = 101; // EH_MODE bit0 still set, auto EH not enabled
        return 0;
    }

    debug_st25_fail_step = 0;
    return 1;
}

int st25dv_write_ndef_text_eeprom(uint8_t *ndef_msg, unsigned int ndef_len)
{
    uint8_t tlv[272]; // buffer for NDEF TLV wrapper plus NDEF message
    unsigned int i; // loop counter
    unsigned int total_len; // total bytes to write to EEPROM
    unsigned int offset; // current EEPROM write offset
    unsigned int chunk_len; // number of bytes to write in current chunk

    debug_eeprom_fail_reason = 0;
    debug_eeprom_offset = 0;
    debug_eeprom_total_len = 0;
    debug_eeprom_chunk_len = 0;

    if (ndef_msg == 0) { // reject null pointer
        debug_eeprom_fail_reason = 1;
        return 0;
    }

    if (ndef_len == 0 || ndef_len > 259) { // keep message safely inside local buffer
        debug_eeprom_fail_reason = 1;
        return 0;
    }

    tlv[0] = 0x03; // NDEF TLV tag
    tlv[1] = (uint8_t)ndef_len; // NDEF message length

    for (i = 0; i < ndef_len; i++) { // copy NDEF record into TLV buffer
        tlv[2 + i] = ndef_msg[i];
    }


    tlv[2 + ndef_len] = 0xFE; // terminator TLV

    total_len = ndef_len + 3; // TLV tag + length + NDEF message + terminator

    while ((total_len % 4) != 0) { // pad to 4-byte boundary so final write is not a partial chunk
        tlv[total_len] = 0x00; // harmless padding after terminator
        total_len++;
    }

    debug_eeprom_total_len = total_len;


    offset = 0;

    while (offset < total_len) {
        chunk_len = total_len - offset;

        if (chunk_len > 4) {
            chunk_len = 4;
        }

        debug_eeprom_offset = offset;
        debug_eeprom_chunk_len = chunk_len;


        {
            uint8_t attempt;
            uint8_t chunk_ok = 0;

            for (attempt = 0; attempt < 5; attempt++) {
                if (st25dv_write_sequence(ST25DV_ADDR_USER, 0x0004 + offset, &tlv[offset], chunk_len)) {
                    chunk_ok = 1;
                    break;
                }

                i2c_bus_recover();          // recover if ST25 NACKed or bus got weird
                __delay_cycles(200000);     // wait 200 ms before retrying same chunk
            }

            if (!chunk_ok) {
                debug_eeprom_fail_reason = 2;
                return 0;
            }
        }

        __delay_cycles(100000); // 100 ms after successful EEPROM chunk write
        offset += chunk_len;
    }

    return 1;
}


// SPI/MAX30002
void spi_pins_init(void) {
    P1SEL0 |= BIT4 | BIT5 | BIT6; // to select SPI, SEL0 needs to have bits 4,5,6 as 1.
    P1SEL1 &= ~(BIT4 | BIT5 | BIT6); // to select SPI, SEL1 needs to have bits
    P1DIR |= BIT7; // bit 7 is output (chip select)
    MAX_CS_HIGH(); // deselect MAX30002 to prevent accidental SPI commands during startup
}

void spi_init(void) { // clock idle low
    UCA0CTLW0 = UCSWRST; // completely reset SPI
    UCA0CTLW0 |= UCMODE_0 | // enabling SPI mode
                 UCSYNC   | // synchronous mode
                 UCMST    | // master mode
                 UCMSB    | // MSB 1st
                 UCCKPH   | // data captured on 1st clock edge, changed at following edge. Data sampled on rising edge.
                 UCSSEL__SMCLK; // enable clock

    UCA0BRW = 10; // clock speed set to 100kHz
    UCA0CTLW0 &= ~UCSWRST;   // begin SPI
}

void max_int_init() {
    P2DIR &= ~BIT1; // set P2.1 as interrupt input from MAX30002
    P2REN |= BIT1; // turn on internal resistor
    P2OUT |= BIT1; // enable pull-up

    P2IES |= BIT1; // detect interrupt on falling edge (1 to 0)
    P2IFG &= ~BIT1; // clear stale interrupt flag
    P2IE |= BIT1; // enable P2.1 interrupt

