neosoultech/bioimpedance_msp430_test/main.c
            if (wait_timeout > 3000000) { // timeout if MAX interrupt never arrives
                debug_max_collect_failed = 1;
                debug_max_wait_timeout_count = wait_timeout;
                return 0;
            }

            continue;
        }

        wait_timeout = 0;

        max_flag = 0;
        status = max30002_read_status();

        if (status & MAX_STATUS_BOVF) { // if FIFO overflow happened, clear FIFO and keep trying
            debug_bovf_count++;
            max30002_fifo_reset();
            max30002_synch();

            discard_count = 0; // restart discard after overflow
            count1 = 0;
            count2 = 0;
            sum1 = 0;
            sum2 = 0;

            continue;
        }

        while ((status & MAX_STATUS_BINT) && (count2 < sample_goal)) {
            raw = max30002_read_fifo(); // getting raw data from MAX
            tag = raw & 0x07; // get FIFO overflow tag

            if (tag == 0x07) { // FIFO overflow tag
                debug_bovf_count++;
                max30002_fifo_reset();
                max30002_synch();

                discard_count = 0; // restart discard after overflow
                count1 = 0;
                count2 = 0;
                sum1 = 0;
                sum2 = 0;

                break;
            }

            if (tag == 0x06) { // if FIFO empty, try again
                break;
            }

            if (tag == 0x00 || tag == 0x02) { // valid sample or valid EOF
                bioz = bioz_parse(raw); // parse data
                debug_bioz = bioz; // debug bioz
                sample_count++; // for debug

                if (discard_count < BIOZ_DISCARD_SAMPLES) { // Throw away early settling samples
                    discard_count++;
                }
                else if (count1 < sample_goal) { // first settled block
                    sum1 += bioz; // sum added
                    count1++; // counter incremented
                }
                else { // second settled block
                    sum2 += bioz; // sum added
                    count2++; // counter incremented
                }
            }

            if (tag == 0x01 || tag == 0x03) { // over/under range
                bioz = bioz_parse(raw);
                debug_bioz = bioz;
            }

            if (tag == 0x02 || tag == 0x03) { // EOF tags
                break;
            }

            status = max30002_read_status();
        }
    }

    if (count1 == 0 || count2 == 0) { // error if no count
        return 0;
    }

    avg1 = (int32_t)(sum1 / count1); // averaging the first 16 samples
    avg2 = (int32_t)(sum2 / count2); // averaging the second 16 samples

    diff = avg1 - avg2; // compare first settled block to second settled block
    if (diff < 0) {
        diff = -diff; // take ||
    }

    if (diff > BIOZ_BLOCK_MISMATCH_LIMIT) { // first block likely still settling or contact artifact if difference is over 500
        return avg2; // use later block only
    }

    return (avg1 + avg2) / 2; // blocks agree, use both
}

uint16_t append_str(uint8_t *buf, uint16_t idx, uint16_t max, const char *s) // appends a normal null-terminated C string into byte buffer
{
    while (*s && idx < max) { // copy until end of buffer full
        buf[idx++] = (uint8_t)(*s++); // copy character by character into buffer
    }
    return idx; // return updated buffer index.
}

uint16_t append_url_int32(uint8_t buf[], uint16_t idx, uint16_t max, int32_t value)
{
    char temp[12];
    uint8_t i = 0;
    uint8_t j;

    if (value < 0) {
        if (idx < max) {
            buf[idx++] = '-';
        }
        value = -value;
    }

    if (value == 0) {
        if (idx < max) {
            buf[idx++] = '0';
        }
        return idx;
    }

    while (value > 0 && i < sizeof(temp)) {
        temp[i++] = (char)('0' + (value % 10));
        value /= 10;
    }

    for (j = 0; j < i; j++) {
        if (idx < max) {
            buf[idx++] = temp[i - 1 - j];
        }
    }

    return idx;
}

uint16_t append_url_x10(uint8_t buf[], uint16_t idx, uint16_t max, int32_t value_x10)
{
    int32_t whole;
    int32_t frac;

    if (value_x10 < 0) {
        if (idx < max) {
            buf[idx++] = '-';
        }
        value_x10 = -value_x10;
    }

    whole = value_x10 / 10;
    frac = value_x10 % 10;

    idx = append_url_int32(buf, idx, max, whole);

    if (idx < max) {
        buf[idx++] = '.';
    }

    if (idx < max) {
        buf[idx++] = (uint8_t)('0' + frac);
    }

    return idx;
}

uint16_t build_bioz_readnfc_text_ndef(uint8_t out[], uint16_t max_len, int32_t target_raw, int32_t reference_raw)
{
    uint8_t text[128];
    uint16_t ti = 0;
    uint16_t i;
    uint16_t text_len;
    uint16_t payload_len;
    uint16_t total_len;

    int32_t diff;
    int32_t percent;
    int32_t zdiff_x10;
    int32_t target_mag;
    int32_t reference_mag;
    int32_t target_ohm_x10;
    int32_t reference_ohm_x10;
    int32_t display_zero;

    target_mag = target_raw;
    reference_mag = reference_raw;

    if (target_mag < 0) {
        target_mag = -target_mag; // keep abs
    }
    if (reference_mag < 0) {
        reference_mag = -reference_mag; // keep abs
    }
    diff = target_mag - reference_mag; // compare magnitudes for user-facing result.

    // Approx ohm difference, target, baseline in tenths using resistor calibration. ohms_x10 = diff * 900 / 15946. (i.e. 10 means +1.0 ohm)
    zdiff_x10 = (int32_t)(((int64_t)diff * BIOZ_CAL_OHM_X10_NUM) / BIOZ_CAL_RAW_DEN);
    target_ohm_x10 = (int32_t)(((int64_t)target_mag * BIOZ_CAL_OHM_X10_NUM) / BIOZ_CAL_RAW_DEN);
    reference_ohm_x10 = (int32_t)(((int64_t)reference_mag * BIOZ_CAL_OHM_X10_NUM) / BIOZ_CAL_RAW_DEN);

    {
    int32_t abs_zdiff_x10;
    abs_zdiff_x10 = zdiff_x10;
    if (abs_zdiff_x10 < 0) {
    abs_zdiff_x10 = -abs_zdiff_x10;
    }
    if (abs_zdiff_x10 < BIOZ_DISPLAY_DEADBAND_OHM_X10) { // checking deadband (anything < 1.0 ohm considered 0% difference)
    percent = 0;
    display_zero = 1;
    }

    else {
    display_zero = 0;
    if (reference_mag != 0) {
    percent = (int32_t)(((int64_t)diff * 100) / reference_mag);
    }
    else {
    percent = 0;
    }
    }
    }
    // Build simple text payload:
    // BIOZ;mode=result;b=0;d=-787;o=-4.4;t=318655;r=319442;to=...;ro=...;z=...
    ti = append_str(text, ti, sizeof(text), BIOZ_TEXT_RESULT_BASE);
    ti = append_url_int32(text, ti, sizeof(text), percent);

    ti = append_str(text, ti, sizeof(text), ";d=");
    ti = append_url_int32(text, ti, sizeof(text), diff);

    ti = append_str(text, ti, sizeof(text), ";o=");
    ti = append_url_x10(text, ti, sizeof(text), zdiff_x10);

