neosoultech/bioimpedance_msp430_test/main.c
    ti = append_str(text, ti, sizeof(text), ";t=");
    ti = append_url_int32(text, ti, sizeof(text), target_mag);

    ti = append_str(text, ti, sizeof(text), ";r=");
    ti = append_url_int32(text, ti, sizeof(text), reference_mag);

    ti = append_str(text, ti, sizeof(text), ";to=");
    ti = append_url_x10(text, ti, sizeof(text), target_ohm_x10);

    ti = append_str(text, ti, sizeof(text), ";ro=");
    ti = append_url_x10(text, ti, sizeof(text), reference_ohm_x10);

    ti = append_str(text, ti, sizeof(text), ";z=");
    ti = append_url_int32(text, ti, sizeof(text), display_zero);

    text_len = ti;

    /*
     * NDEF Text record format:
     * Header: 0xD1
     * Type length: 1
     * Payload length: 1 status byte + 2 language bytes + text length
     * Type: 'T'
     * Payload:
     *   status byte = 0x02 means UTF-8, language code length 2
     *   language = "en"
     *   actual text payload
     */
    payload_len = 1 + 2 + text_len;
    total_len = 4 + payload_len;

    if (total_len > max_len || payload_len > 255) {
        return 0;
    }

    out[0] = 0xD1;                 // MB/ME/SR set, well-known record
    out[1] = 0x01;                 // type length = 1
    out[2] = (uint8_t)payload_len; // short record payload length
    out[3] = 'T';                  // NDEF Text record type

    out[4] = 0x02;                 // UTF-8, language code length = 2
    out[5] = 'e';
    out[6] = 'n';

    for (i = 0; i < text_len; i++) {
        out[7 + i] = text[i];
    }

    return total_len;
}

uint16_t build_scanning_readnfc_text_ndef(uint8_t out[], uint16_t max_len)
{
    uint8_t text[40];
    uint16_t ti = 0;
    uint16_t i;
    uint16_t text_len;
    uint16_t payload_len;
    uint16_t total_len;

    // Simple first-read payload.
    // Power Apps does not really need to parse this deeply;
    // the main purpose is to energize/trigger the patch.
    ti = append_str(text, ti, sizeof(text), BIOZ_TEXT_SCANNING);

    text_len = ti;

    payload_len = 1 + 2 + text_len;
    total_len = 4 + payload_len;

    if (total_len > max_len || payload_len > 255) {
        return 0;
    }

    out[0] = 0xD1;
    out[1] = 0x01;
    out[2] = (uint8_t)payload_len;
    out[3] = 'T';

    out[4] = 0x02; // UTF-8, language code length = 2
    out[5] = 'e';
    out[6] = 'n';

    for (i = 0; i < text_len; i++) {
        out[7 + i] = text[i];
    }

    return total_len;
}

// LED STATUS INDICATORS
void led_blink_measuring (void) { // blinking LED = measurement
    LED_TOGGLE();
    __delay_cycles (200000); // 0.2 seconds at 1MHz
}
void led_pulse_transmission (void) { // short pulse = successful event
    LED_ON();
    __delay_cycles(300000); // 0.3 second pulse
    LED_OFF();
}
void led_idle(void) { // LED off = idle/sleeping
    LED_OFF();
}
void error_handler (void) { // ensures LED is solid during error
    LED_ON();

    while(1); // LED stays permanently on with error
}

void led_double_pulse(void) // double pulse = internal state reset
{
    LED_ON();
    __delay_cycles(180000);
    LED_OFF();
    __delay_cycles(180000);
    LED_ON();
    __delay_cycles(180000);
    LED_OFF();
}
// EXP430 buttons
void button_s1_init(void) { // helper function to initialize buttons on EXP430FR2433 dev kit
    // S1 = P2.3
    // active-low buttons w/ internal pullups

    P2SEL0 &= ~(BUTTON_S1_BIT); // GPIO mode
    P2SEL1 &= ~(BUTTON_S1_BIT); // GPIO mode
    P2DIR &= ~(BUTTON_S1_BIT); // // S1 as input
    P2REN |= (BUTTON_S1_BIT); // turn on resistors
    P2OUT |= (BUTTON_S1_BIT); // turn on pullups
    P2IE &= ~(BUTTON_S1_BIT); // turn off hardware interrupts
    P2IFG &= ~(BUTTON_S1_BIT); // clear any interrupt flags
}
void wait_for_s1_press(void) { // blocks execution until button S1 fully pressed & released
    while (P2IN & BUTTON_S1_BIT); // BUTTON_S1_BIT is 0 if pressed
    __delay_cycles(50000); // 50ms debounce
    while (!(P2IN & BUTTON_S1_BIT));
    __delay_cycles(50000);
}
